nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_v4/INTELENICS_Library/src/INT_STM32F4_GSM.c
/**
  ******************************************************************************
  * @file    INT_STM32F4_GSM.c
  * @author  Intelenics Application Team
  ******************************************************************************
**/
/* Private include -----------------------------------------------------------*/
#include "main.h"
#include "INT_STM32F4_GSM.h"
#include "INT_STM32F4_Usart.h"
#include "INT_STM32F4_debug.h"
#include "INT_STM32F4_PacketQueue.h"

#include "FreeRTOS.h"

#include "SL_PinDefine.h"

#include <stdio.h>
#include <stdlib.h>
#include <String.h>
#include <stdbool.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define NBUF 							( 30 )

#define INDEX_FRAMETYPE		( 21 )
#define INDEX_FRAMEDATA		( 22 )

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
extern xQueueHandle Queue_PacketFromGSM;

uint32_t uiNByte = 0;

/* Private function prototypes -----------------------------------------------*/
static eGSMErrorCode 			ucGSM_waitForOk( uint8_t* str, uint16_t time_wait );
static eGSMConnectStatus ucGSM_waitForConnect( uint16_t time_wait );
static uint8_t 						ucGSM_checksum( uint8_t buf[],uint16_t ulLength );
static uint8_t						ucGSM_escapes( const uint8_t* ucSrc, uint8_t* ucRetSrc, uint32_t ulLength );

/*============================================================================================*/
/**
  * @brief  Initialize GSM module
  * @param  None
  * @retval None
  */
uint8_t ucGSM_Initialize( void ) {
	printf( "ATE0\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"ATE0\r\n",6 );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	// Set the context 0 as FGCNT
	printf( (const char *)"AT+QIFGCNT=0\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QIFGCNT=0\r\n",14 );
	//len = read_uart0( buf,10,interchar );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	//Set APN.
	printf( "AT+QICSGP=1,\"www.dtac.co.th\"\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QICSGP=1,\"www.dtac.co.th\"\r\n",31 );
	//len = read_uart0( buf,10,interchar );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	// 0 disables the function of MUXIP. 1 enables the function.
	printf( "AT+QIMUX=0\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QIMUX=0\r\n",12 );
	//len = read_uart0( buf,10,interchar );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	// Set the session mode as non-transparent.
	printf( "AT+QIMODE=0\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QIMODE=0\r\n",13 );
	//len = read_uart0( buf,10,interchar );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	// Use IP address to establish TCP/UDP session.
	printf( "AT+QIDNSIP=0\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QIDNSIP=0\r\n",14 );
	//len = read_uart0( buf,10,interchar );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	// Register the TCP/IP stack.
	printf( "AT+QIREGAPP\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QIREGAPP\r\n",13 );
	//len = read_uart0( buf,10,interchar );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	// Activate FGCNT.
	printf( "AT+QIACT\r\n" );
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QIACT\r\n",10 );
	//len = read_uart0( buf,10,interchar );
	ucGSM_waitForOk( (uint8_t *)"OK",1000 );
	
	return 0;
}
/*============================================================================================*/ 
/** * @brief Power off GSM module. 
		* @param None * @retval None 
*/ 
void vGSM_PowerOff( void ) { 
	printDebug_Semphr( INFO, "<GSM_PowerOff>: GSM Power Off!!! \r\n" ); /* check GSM module status */ 
	vGSM_SendATcommand( ( uint8_t* )"AT\r\n", 4 ); 
	if ( ucGSM_waitForOk( (uint8_t *)"OK", 50 ) == GSM_ENOERR ) { /* Power off GSM module */ 
		GPIO_SetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN ); 
		delay_ms( 1000 ); GPIO_ResetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN ); 
	} 
}

/*============================================================================================*/
/**
  * @brief  Start GSM module.
  * @param  None
  * @retval None
  */
void vGSM_Start( void ) {
//  	uint8_t ESC[2] = {0x33,0x00};
	uint8_t i=0;
	uint8_t CTRL_Z[2]; CTRL_Z[0] = 0x1A; CTRL_Z[1] = '\0';
	
	printDebug_Semphr( INFO, "<GSM_Start>: GSM Power On!!! \r\n" );
	
	vGSM_SendATcommand( CTRL_Z, 1 );
	
	while(i<11) {
		/* check GSM module status */
		vGSM_SendATcommand( ( uint8_t* )"AT\r\n", 4 );
		if ( ucGSM_waitForOk( (uint8_t *)"OK", 200 ) != GSM_ENOERR ) {
			/* GSM module off */
			printDebug_Semphr( INFO,"[GSM_TASK]: AT error\r\n" );
			
			/* start module wait 2s */
			GPIO_SetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN );
			delay_ms( 2500 );
			GPIO_ResetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN );
		}
		else {
			/* GSM module on */
			printDebug_Semphr( INFO,"[GSM_TASK]: AT OK\r\n" );
			break;
		}
		i++;
		delay_ms( 5000 );
		eGSM_receivePacket();
	}
	
	vGSM_SendATcommand( ( uint8_t* )"AT+QIREGAPP\r\n", 13 );
	if ( ucGSM_waitForOk( (uint8_t *)"OK", 5 ) != GSM_ENOERR )
		printDebug_Semphr( DETAIL,"[GSM_TASK]: AT+QIREGAPP error\r\n" );
	vGSM_SendATcommand( ( uint8_t* )"AT+QIPROMPT=2\r\n", 15 );
	if ( ucGSM_waitForOk( (uint8_t *)"OK", 5 ) != GSM_ENOERR )
		printDebug_Semphr( DETAIL,"[GSM_TASK]: AT+QIPROMPT error\r\n" );
	vGSM_SendATcommand( ( uint8_t* )"ATE0\r\n", 6 );
	if ( ucGSM_waitForOk( (uint8_t *)"OK", 5 ) != GSM_ENOERR )
		printDebug_Semphr( DETAIL,"[GSM_TASK]: ATE0 error\r\n" );
	vGSM_SendATcommand( ( uint8_t* )"AT+IPR=115200\r\n", 15 );
	if ( ucGSM_waitForOk( (uint8_t *)"OK", 5 ) != GSM_ENOERR )
		printDebug_Semphr( INFO,"[GSM_TASK]: AT+IPR error\r\n" );
	vGSM_SendATcommand( ( uint8_t* )"AT&W\r\n", 6 );
	if ( ucGSM_waitForOk( (uint8_t *)"OK", 5 ) != GSM_ENOERR )
		printDebug_Semphr( DETAIL,"[GSM_TASK]: AT&W error\r\n" );
	
}
/*============================================================================================*/
/**
  * @brief  Start GSM module.
  * @param  None
  * @retval None
  */
void vGSM_Restart( void ) {
	printDebug_Semphr( INFO, "<GSM_Restart>: GSM HW Reset!!! \r\n" );
	
	/* Reset GSM module */
	GPIO_SetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN );
	delay_ms( 1000 );
	GPIO_ResetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN );
	
	delay_ms( 5000 );
	GPIO_SetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN );
	delay_ms( 1000 );
	GPIO_ResetBits( GSM_SWITCH_PORT, GSM_SWITCH_PIN );
	
	delay_ms( 10000 );
	vGSM_Start( );
	
