nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_v4/INTELENICS_Library/src/INT_STM32F4_GSM.c
}
/*============================================================================================*/
/**
  * @brief  Connect to TCP/IP
  * @param  IP 		: IP Address
						port 	: number port
  * @retval Connection GSM status
							- 0 : connect fail
							- 1 : connect ok
  */
uint8_t ucGSM_ConnectTCP( char *IP,int port ) {
	/*-- Variable about  --*/
	eGSMState 					eState = GSM_STATE_IPCLOSE;
	eGSMConnectStatus		eConnectStatus;
	
	uint8_t 	CMD_openTCP[100];
	
 	while ( 1 ) {
 		switch ( eState ) {			
			case GSM_STATE_IPCLOSE :
				/* Connect to server with IP address and port. */
				printDebug_Semphr( DETAIL,"[GSM_TASK]: AT+QIOPEN\r\n" );
				sprintf( ( char* )CMD_openTCP,"AT+QIOPEN=\"TCP\",\"%s\",%d\r\n",IP,port );
				vGSM_SendATcommand( CMD_openTCP, strlen( ( char* )CMD_openTCP ) );
				
				/* delay wait response. */
				delay_ms( 1000 );
			
				/* Check connection. */
				eConnectStatus = ucGSM_waitForConnect( 6000 );
				if( eConnectStatus == GSM_CONNECT_OK ) {
					eState = GSM_STATE_CONNECTOK;
				}
				else {
					eState = GSM_STATE_CMDERROR;
				}
				break;
				
			case GSM_STATE_CONNECTOK :
					return GSM_CONNECT_OK;
			
			case GSM_STATE_CMDERROR :
				return GSM_CONNECT_FAIL;
			
		}
 	}
}
/*============================================================================================*/
/**
  * @brief  Query current connection status.
  * @param  None
  * @retval GSM state
  */
eGSMState ucGSM_QueryState( void ) {
	/*-- Variable about check response --*/
	char			*ucBufferCheck;
	uint8_t 	ucBuffer[40];
	uint8_t 	ucLength;
	
	/*-- Variable about timer --*/
	uint8_t ucInterchar = 1, ucTimewait = 1;
	
	/* Send AT command to query connection state */
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QISTAT\r\n", 11 );
	
	while( 1 ) {
		/* wait response and clear buffer */
		delay_ms( 200 );
		strcpy( ( char* )ucBuffer, " " );
		
		/* Read response from GSM */
		ucLength = usiUSART_ReadGSM( ucBuffer, 40, ucInterchar );
		
		/* checking state */
		ucBufferCheck = strstr( ( char* )ucBuffer, "CONNECT OK" );
		if( ucBufferCheck[0] == 'C' ){ return GSM_STATE_CONNECTOK; }
		
		ucBufferCheck = strstr( ( char* )ucBuffer, "IP CLOSE" );
		if( ucBufferCheck[0] == 'I' ){ return GSM_STATE_IPCLOSE; }
		
		ucBufferCheck = strstr( ( char* )ucBuffer, "ERROR" );
		if( ucBufferCheck[0] == 'I' ){ return GSM_STATE_CMDERROR; }
				
		ucTimewait--;
		if( ucTimewait <= 0 ) {
			return GSM_STATE_IPCLOSE;
		}
	}
}
/*============================================================================================*/
/**
  * @brief  Send AT Command to GSM Module
  * @param  s : string command
						size : size string
  * @retval -
  */
void vGSM_SendATcommand( volatile uint8_t *s, uint32_t size ) {
	uint32_t cnt=0;
	
	while( cnt < size ) {
// 		printDebug_Semphr( INFO,"%c",s[cnt]);
		/* wait until data register is empty */
		while( !( EVAL_COM3->SR & 0x00000040 ) );
		USART_SendData( EVAL_COM3, s[cnt] );
		cnt++;
	}
//	printDebug_Semphr( INFO, "[GSM_TASK]: size pkt to send : %d\r\n", cnt );
}
/*============================================================================================*/
/**
  * @brief  Tranmit packet to server
  * @param  ucStrPacket : Data packet
						ulLength		: length packet
  * @retval None
  */
eGSMReturnCode eGSM_transmitPacket( uint8_t *ucStrPacket, uint32_t uiLength ) {
	uint8_t 	ucStrEscape[RX_BUFFER_SIZE3];
 	uint8_t 	ucSize = 0;
	
	/* Special Character AT command for send packet ( Ctrl+Z )*/
	uint8_t CTRL_Z[2]; CTRL_Z[0] = 0x1A; CTRL_Z[1] = '\0';
	
	/*------------------------------------------------------------------*/
	
 	/*	Show old packet	*/
	if( xSemaphoreTake( xSemaphore, SEMPHR_WAIT ) ) {
		printDebug( DETAIL, "[GSM_TASK]: Send : %d\r\n", uiLength );
		print_payload( DETAIL, ucStrPacket, uiLength );
		printDebug(DETAIL, "\r\n");
		xSemaphoreGive(xSemaphore);
	}

 	/*	escapes packet	*/
 	ucSize = ucGSM_escapes( ucStrPacket, ucStrEscape, uiLength );
	
 	/*=======================	Send Packet	========================*/
	printDebug_Semphr( DETAIL, "[GSM_TASK]: AT+QISEND\r\n" );
  vGSM_SendATcommand( (volatile uint8_t *)"AT+QISEND\r", 10 );
	delay_ms( 100 );

	vGSM_SendATcommand( ucStrEscape, ucSize );
	vGSM_SendATcommand( CTRL_Z, 1 );
	
	return GSM_RET_OK;
}
/*============================================================================================*/
/**
  * @brief  receive Packet from UART5 and send packet to Manager Task
  * @param  None
  * @retval Return protocol function code
  */
eGSMReturnCode eGSM_receivePacket( void ) {
 	PACKET_DATA sFormatrecv_GSM;
	
	uint8_t 		recvPacket[RX_BUFFER_SIZE3];           
	uint16_t 		size = 0;
	
	// -- for packet validation -- //
	uint16_t 	offset = 0;
	uint16_t 	ulLength = 0x0000;
	uint16_t 	total = 0;
	
	int 			cmp_res = 0;
	char			str_ok[] = {"\r\nOK\r\n"};
	char			str_err[] = {"\r\nERROR\r\n"};
	char			str_close[] = {"\r\nCLOSED\r\n"};
	
	char 			*Credit;
	/* --------------- Process GSM Data ---------------- */// USART 3
	strcpy( ( char* )recvPacket, " " );
	size = usiUSART_ReadGSM( recvPacket, RX_BUFFER_SIZE3, 5 );
	if( size <= 0 ) {
		/* Not have receive data packet */
		return GSM_RET_PKT_EMPTY;
	}
 	else {
		if( size < 20 ) {
			if( xSemaphoreTake( xSemaphore, SEMPHR_WAIT ) ){
				printDebug( INFO, "[GSM_TASK]: Receive : %d\r\n", size );
				print_payload( INFO, recvPacket, size );
				xSemaphoreGive( xSemaphore );
			}	
			cmp_res = memcmp( ( char* )recvPacket, str_ok, 6 );
			if(cmp_res == 0) {
				printDebug_Semphr( INFO, "[GSM_TASK]: OK \r\n" );
			}
			cmp_res = memcmp((char*)recvPacket, str_err, 9);
			if( cmp_res == 0 ) {
				printDebug_Semphr( MINOR_ERR, "[GSM_TASK]: ERROR \r\n" );
			}
			cmp_res = memcmp((char*)recvPacket, str_close, 10);
			if( cmp_res == 0 ) {
				printDebug_Semphr( MINOR_ERR, "[GSM_TASK]: CLOSED \r\n" );
				return GSM_RET_CLOSED;
			}
		}
		
 		/*		Show All Packet		*/
 		if( xSemaphoreTake( xSemaphore, SEMPHR_WAIT ) ){
 			printDebug( INFO, "[GSM_TASK]: Rcv : %d\r\n", size );
 			print_payload( INFO, recvPacket, size );
 			printDebug( INFO, "\r\n" );
 			xSemaphoreGive( xSemaphore );
 		}
 	}
	do {		
		/* seach for header */
		offset += strcspn( ( char* )&recvPacket[offset], "\x7E" );
		if( offset >= size ) {
			printDebug_Semphr( WARNING,"[GSM_TASK]: invalid coordinator packet\r\n" );   	// not found Start Delimiter 0x7E
			break;
		}
		ulLength = ( recvPacket[offset+1] & 0xffff )<< 8;             // check packet length ( MSB )
		ulLength |= recvPacket[offset+2];                            // check packet length ( LSB )
		printDebug_Semphr( DETAIL,"[GSM_TASK]: len=%d( %04x )offset: %d, size: %d\r\n", ulLength, ulLength, offset, size );						// Show packet ulLengthgth
		
		total += ulLength;                                          	// update total analyse 
		if ( total > size )	{																			// check length validation	
			offset++;
			total = offset;                                     	// roll back total analyse                          
			printDebug_Semphr( WARNING,"[GSM_TASK]: invalid length!!\r\n" );
			continue;
		}
		
    /* checksum error detection */
		printDebug_Semphr( DETAIL,"[GSM_TASK]: checksum = %02X\r\n", recvPacket[offset+3+ulLength] );
		if( ucGSM_checksum( &recvPacket[offset+3], ulLength )!= recvPacket[offset+3+ulLength] ) {
			printDebug_Semphr( WARNING,"[GSM_TASK]: checksum error\r\n" );
			offset++;
			total = offset;                                    		// roll back total analyse          
		}
    else {
			/* got a valid packet */
			printDebug_Semphr( DETAIL,"[GSM_TASK]: checksum correct\r\n" );
			
			/* analyse API-specific Structure */
			sFormatrecv_GSM.length = ulLength;
			memcpy( sFormatrecv_GSM.packet, &recvPacket[offset+3], sFormatrecv_GSM.length );
		
			/* send queue to Manager task */
			if( !xQueueSend( Queue_PacketFromGSM, &sFormatrecv_GSM , 0 ) ){
				printDebug_Semphr( WARNING,"[GSM_TASK]: can not send Queue_PacketFromGSM to Manager task\r\n" );
			}
		}
		offset += 4+ulLength;
		total = offset;
 	}while( total < size );
	
 	return GSM_RET_OK;
}
/*============================================================================================*/
/**
  * @brief  Query Credit balance
  * @param  Provider 	: Network provider
						code			: Prepaid code
  * @retval None
  */
void vGSM_QueryCreditBalance( uint8_t ucProvider, uint8_t *ucCode ) {
	char ucBuffer[50];
	
