nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_v4/INTELENICS_Library/src/INT_STM32F4_GSM.c
	/* Check Provider. */
	if( ucProvider == GSM_Provider_AIS ) {
		sprintf( ucBuffer, "AT+CUSD=1,\"*120*%s#\"\r\n", ( char* )ucCode );
		vGSM_SendATcommand( ( uint8_t* )ucBuffer, strlen( ( char* )ucBuffer ) );
	}
	else if( ucProvider == GSM_Provider_DTAC ) {
		sprintf( ucBuffer, "AT+CUSD=1,\"*100*%s#\"\r\n", ( char* )ucCode );
		vGSM_SendATcommand( ( uint8_t* )ucBuffer, strlen( ( char* )ucBuffer ) );
	}
	else {
		printDebug_Semphr( WARNING, "[GSM_TASK]: Add Credit Balance [Provider not found]\r\n" );
	}
}

/*============================================================================================*/
/**
  * @brief  Read Credit balance by send at command
  * @param  Provider : Network provider 
  * @retval None
  */
void vGSM_ReadCreditBalance( uint8_t ucProvider ) {
	/* Check Provider */
	if ( ucProvider == GSM_Provider_AIS ) {
		/* send at command fot ais provider */
		vGSM_SendATcommand( (volatile uint8_t *)"AT+CUSD=1,\"*121#\"\r\n",19 );
	}
	else if ( ucProvider == GSM_Provider_DTAC ) {
		/* send at command fot dtac provider */
		vGSM_SendATcommand( (volatile uint8_t *)"AT+CUSD=1,\"*101*9#\"\r\n",21 );
	}
	else {
		printDebug_Semphr( WARNING,"[GSM_TASK]: Read credit balance [Provider not found]\r\n" );
	}
}
/*============================================================================================*/
/**
  * @brief  Get Network provider.
  * @param  None
  * @retval Provider : Network provider
  */
uint8_t ucGSM_GetProvider( void ) {
	char 		*ucBuffer;
	uint8_t ucLength=0;
	
	/* send at command fot read provider */
	vGSM_SendATcommand( (volatile uint8_t *)"AT+COPS?\r\n", 10 );
	delay_ms( 50 );
	
	ucLength = usiUSART_ReadGSM( ( uint8_t* )ucBuffer, 20, 50 );
	
	if( ucLength > 0 ) {
		/* -------checking for AIS ------- */
		ucBuffer = strstr( ( char* )ucBuffer, "AIS" );
		if( ucBuffer[0] == 'A' ) { return GSM_Provider_AIS; }
		
		/* -------checking for DTAC ------- */
		ucBuffer = strstr( ( char* )ucBuffer, "DTAC" );
		if( ucBuffer[0] == 'D' ) { return GSM_Provider_DTAC; }
		
		/* -------checking for TRUE ------- */
		ucBuffer = strstr( ( char* )ucBuffer, "TRUE" );
		if( ucBuffer[0] == 'T' ) { return GSM_Provider_TRUE; }
		
	}
	else {
		printDebug_Semphr( WARNING,"[GSM_TASK]: Get Provider error\r\n" );
	}
}
/*============================================================================================*/
/**
  * @brief  Get Network provider.
  * @param  Provider : Network provider
  * @retval None
  */
void vGSM_SetAPN( uint8_t ucProvider ) {
	
	/* Check Provider */
	if ( ucProvider == GSM_Provider_AIS ) {
		/* send at command fot set apn of ais provider */
		vGSM_SendATcommand( (volatile uint8_t *)"AT+QICSGP=1,\"internet\"\r\n", 24 );
		if( ucGSM_waitForOk( (uint8_t *)"OK", 5 )!= GSM_ENOERR ) {
			printDebug_Semphr( DETAIL, "[GSM_TASK]: Set APN error\r\n" );
		}
	}
	else if ( ucProvider == GSM_Provider_DTAC ) {
		/* send at command fot set apn of DTAC */
		vGSM_SendATcommand( (volatile uint8_t *)"AT+QICSGP=1,\"www.dtac.co.th\"\r\n", 30 );
		if( ucGSM_waitForOk( (uint8_t *)"OK", 5 )!= GSM_ENOERR ) {
			printDebug_Semphr( DETAIL, "[GSM_TASK]: Set APN error\r\n" );
		}
	}
	else {
		printDebug_Semphr( WARNING,"[GSM_TASK]: Set APN [Provider not found]\r\n" );
	}
}
/*============================================================================================*/
/**
  * @brief  Read signal quality report.
  * @param  None
  * @retval Return signal percent(0-100%)
  */
uint8_t ucGSM_ReadSignalQuality( void ) {
	uint8_t ucStr_CSQ[5] = "+CSQ";
	uint8_t ucBuffer[20];
	uint8_t	ucSignalPrecent;
	uint8_t i=0,j=0,ucLength=0;
	char		ucGSM_RSSI, *ucStrRSSI;
	
	/* send at command for read signal quality report */
	vGSM_SendATcommand( (volatile uint8_t *)"AT+CSQ\r\n", 8 );
	delay_ms( 50 );
	ucLength = usiUSART_ReadGSM( ucBuffer, 20, 50 );

/*========== code retrun from module ===================	
		0			:	-113 dBm or less
		1			:	-111 dBm
		2..30	:	-109..-53 dBm
		31		:	-51 dBm or greater
		99		:	Not know or not detectable 
========================================================*/
	
	for( i=0, j=0; i < ucLength; i++ ) {
		 if( ( ucBuffer[i] == ucStr_CSQ[j] ) )j++;
		 else j = 0;
		 if( j == ( strlen( ( char* )ucStr_CSQ ) ) ) {
			 ucStrRSSI 	= strtok( ( char* )ucBuffer, " " );
			 ucStrRSSI 	= strtok( NULL, "," );
			 ucGSM_RSSI = atoi( ( char* )ucStrRSSI );
			 
			 if( ucGSM_RSSI == 99 ) { return 0; }
			 
			 /* RSSI convert to precent(%) */
			 ucSignalPrecent = ucGSM_RSSI * 3.33;
			 if( ucSignalPrecent > 100 ) {ucSignalPrecent = 100;}
 			 return ucSignalPrecent;
		 }
	}
	printDebug_Semphr( INFO, "[GSM_TASK]: Signal Quality not value\r\n" );	
	return 0;
}
/*============================================================================================*/
/**
  * @brief  Close TCP or UDP connection
  * @param  None
  * @retval None
  */
void vGSM_CloseConnection( void ) {
	/* send at command close connection */
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QICLOSE\r\n", 11 );
	if( ucGSM_waitForOk( (uint8_t *)"CLOSE", 5 )== GSM_ENOERR ) {
		printDebug_Semphr( DETAIL, "[GSM_TASK]: CLOSE OK\r\n" );
	}
	else {
		printDebug_Semphr( WARNING, "[GSM_TASK]: CLOSE ERROR\r\n" );
	}
	
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QIDEACT\r\n", 12 );
	if( ucGSM_waitForOk( (uint8_t *)"DEACT OK", 200 )== GSM_ENOERR ) {
		printDebug_Semphr( DETAIL, "[GSM_TASK]: DEACT OK\r\n" );
	}
	else {
		printDebug_Semphr( WARNING, "[GSM_TASK]: DEACT ERROR\r\n" );
	}
}
/*============================================================================================*/
/**
  * @brief  
  * @param  None
  * @retval None
  */
void vGSM_SendHTTPGET( uint8_t* ucURL, uint16_t LenURL ) {
	uint8_t ESC[2] = {0x33,0x00};
	uint8_t* 	ucStrCommand[255];
	uint16_t	Timeout	= 100;

	sprintf( (char*)ucStrCommand, "AT+QHTTPURL=%d,%d\r\n", LenURL, Timeout );
	printDebug_Semphr( ALWAYS, "[GSM_TASK]: %s(%d)\r\n", ucURL, LenURL );
	vGSM_SendATcommand( (volatile uint8_t *)ucStrCommand, 20 );
	if( ucGSM_waitForOk( (uint8_t *)"CONNECT", 200 )== GSM_ENOERR ) {
		printDebug_Semphr( ALWAYS, "[GSM_TASK]: Connect Http OK\r\n" );
	}
	else {
		printDebug_Semphr( ALWAYS, "[GSM_TASK]: Connect Http error\r\n" );
	}
 	
