nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_v4/INTELENICS_Library/src/INT_STM32F4_GSM.c
	vGSM_SendATcommand( ucURL, LenURL );
	if( ucGSM_waitForOk( (uint8_t *)"OK" ,200 )== GSM_ENOERR ) {
		printDebug_Semphr( ALWAYS, "[GSM_TASK]: input URL OK\r\n" );
	}
	else {
		printDebug_Semphr( ALWAYS, "[GSM_TASK]: input URL error\r\n" );
	}
 	
	vGSM_SendATcommand( (volatile uint8_t *)"AT+QHTTPGET=60\r\n", 16 );
	if( ucGSM_waitForOk( (uint8_t *)"OK", 200 )== GSM_ENOERR ) {
		printDebug_Semphr( ALWAYS, "[GSM_TASK]: GET OK\r\n" );
	}
	else {
		vGSM_SendATcommand( ESC, 2 );
		printDebug_Semphr( ALWAYS, "[GSM_TASK]: GET error\r\n" );
	}
// 	
//	vGSM_SendATcommand( (volatile uint8_t *)"AT+QHTTPREAD=30\r\n", 17 );
// 	if( ucGSM_waitForOk( (uint8_t *)"OK", 200 )== GSM_ENOERR ) {
// 		printDebug_Semphr( INFO, "[GSM_TASK]: READ OK\r\n" );
// 	}
// 	else {
// 		printDebug_Semphr( INFO, "[GSM_TASK]: READ error\r\n" );
// 	}
// 	
	delay_ms(1000);
}

/*============================================================================================
Support Function
============================================================================================*/
/**
  * @brief  Check packet OK or ERROR
  * @param  None
  * @retval GSM error code
  */
static eGSMErrorCode ucGSM_waitForOk( uint8_t* ucStr, uint16_t ulTimewait ) {
	eGSMErrorCode eStatus = GSM_ETIMEDOUT;
	
	/*-- Variable about check response --*/
	uint8_t 	ucBuffer[15];
	uint8_t 	ucLength;
	uint8_t		ucInterchar = 50;
	char			*ucBufferCheck;
	
	while( ulTimewait > 0 ) {
		/* wait response and clear buffer */
		delay_ms( 100 );
		strcpy( ( char* )ucBuffer, " " );
		
		ucLength = usiUSART_ReadGSM( ucBuffer, 12, ucInterchar );
		
		if( ucLength > 0 ) {
			
			if( xSemaphoreTake( xSemaphore, SEMPHR_WAIT ) ){
				printDebug( DETAIL, "<GSM_waitForOk>: " );
				print_payload( DETAIL, ucBuffer, 12 );
				printDebug( DETAIL, "\r\n" );
				xSemaphoreGive( xSemaphore );
			}	
			ucBufferCheck = strstr( ( char* )ucBuffer, ( char* )ucStr );
			if( ucBufferCheck[0] == ucStr[0] ){ return GSM_ENOERR; }
			
			ucBufferCheck = strstr( ( char* )ucBuffer, "ERROR" );
			if( ucBufferCheck[0] == 'E' ){ return GSM_ECMD; }
		}
		ulTimewait--;
	}
	return eStatus;
}
/*============================================================================================*/
/**
  * @brief  Check connection ok or fail
  * @param  None
  * @retval GSM ack messages
						- 0x00 : Connect OK
						- 0x01 : Connect ERROR
						- 0x02 : Timeout
						- 0x03 : Already connect
  */
static eGSMConnectStatus ucGSM_waitForConnect( uint16_t time_wait ) {
	/*-- Variable about check response --*/
	uint8_t 	ucBuffer[NBUF];
	uint8_t 	ucLength;
	char			*ucBufferCheck;
	
	/*-- Variable about time wait --*/
	uint8_t		ucInterchar 				= 1;
	uint8_t CTRL_Z[2]; CTRL_Z[0] = 0x1A; CTRL_Z[1] = '\0';
	
	/* wait response */
	delay_ms( 3000 );
	while( 1 ) {
		delay_ms( 10 );
		/* Clear buffer */
		strcpy( ( char* )ucBuffer, " " );
		
		/* Read response from GSM */
		ucLength = usiUSART_ReadGSM( ucBuffer, NBUF, ucInterchar );
//  		printf( "%s\r\n",ucBuffer );
		
		if( ucLength > 0 ) {
			/* -------checking for ALREADY------- */
			ucBufferCheck = strstr( ( char* )ucBuffer, "ALREADY" );
			if( ucBufferCheck[0] == 'A' ){ return GSM_CONNECT_OK; }
			
			/* -------checking for CONNECT OK------- */
			ucBufferCheck = strstr( ( char* )ucBuffer, "CONNECT OK" );
			if( ucBufferCheck[0] == 'C' ){ return GSM_CONNECT_OK; }
			
			/* -------checking for CONNECT FAIL------- */
			ucBufferCheck = strstr( ( char* )ucBuffer, "FAIL" );
			if( ucBufferCheck[0] == 'F' ){ return GSM_CONNECT_FAIL; }
			
			/* -------checking for CONNECT ERROR------- */
			ucBufferCheck = strstr( ( char* )ucBuffer, "ERROR" );
			if( ucBufferCheck[0] == 'E' ){ return GSM_CONNECT_FAIL; }
		}
		
		time_wait--;
		if( time_wait <= 0 ) {
			vGSM_SendATcommand( CTRL_Z, 1 );
			printDebug_Semphr( WARNING,"[GSM_TASK]: timeout!!\r\n" );
			return GSM_CONNECT_FAIL;
		}
	}
}
/*============================================================================================*/
/**
  * @brief  escapes packet for send to server
  * @param  src : packet
  * @retval size : size of packet after escapes
  */
static uint8_t ucGSM_escapes( const uint8_t* ucSrc, uint8_t* ucRetSrc, uint32_t ulLength )
{
	uint8_t ucCnt 				= 0;
	uint8_t ucIndex 			= 0;
	uint8_t ucCharacter;
	
	/************************************************************ 
		ex :: 0x01 0x1A 0x57 --after escapes--> 0x01 0xFE 0x01 0x57  
	**************************************************************/
	while( ucCnt != ulLength ) {
		ucCharacter = *( ucSrc++ );
		switch( ucCharacter ) {
			case 0x1A : 
				ucRetSrc[ucIndex++] = 0xFE;
				ucRetSrc[ucIndex++] = 0x01;
				break;
			case 0x08 : 
				ucRetSrc[ucIndex++] = 0xFE;
				ucRetSrc[ucIndex++] = 0x02;
				break;
			case 0x1B :
				ucRetSrc[ucIndex++] = 0xFE;
				ucRetSrc[ucIndex++] = 0x03;
			break;
			case 0xFE :
				ucRetSrc[ucIndex++] = 0xFE;
				ucRetSrc[ucIndex++] = 0xFE;
				break;
			default :
				ucRetSrc[ucIndex++] = ucCharacter;
		}
		ucCnt++;
	}
	ucRetSrc[ucIndex] = '\0';/* Ensure nul terminator */
	return ucIndex;
}
/*============================================================================================*/
/**
  * @brief  check length packet
  * @param  buf[] : buffer
						len   : length
  * @retval check sum value
  */
static uint8_t ucGSM_checksum( uint8_t buf[], uint16_t ulLength ) {
	uint16_t 	i;
  uint8_t 	sum = 0;
	
  for( i = 0; i < ulLength; i++ ) {
		sum += buf[i];
  }                 
  return ( 0xff - ( sum & 0xff ) );
}

/*********** Portions COPYRIGHT 2014 Intelenics. Co., Ltd.*****END OF FILE****/
